In [1]:
import pandas as pd

### Python Datetime Function

In [2]:
from datetime import datetime

date = datetime.today()
print("Date = ", date)
print("Year = ", date.year)
print("Month = ", date.month)
print("Day = ", date.day)
print("Hour = ", date.hour)
print("Min = ", date.minute)
print("Second = ", date.second)

Date =  2022-07-24 11:36:37.707953
Year =  2022
Month =  7
Day =  24
Hour =  11
Min =  36
Second =  37

Directive	Meaning	Example
"%a"	Abbreviated weekday name.	Sun, Mon, ...

"%A"	Full weekday name.	Sunday, Monday, ...

"%w"	Weekday as a decimal number.	0, 1, ..., 6

"%d"	Day of the month as a zero-padded decimal.	01, 02, ..., 31

"%-d"	Day of the month as a decimal number.	1, 2, ..., 30

"%b"	Abbreviated month name.	Jan, Feb, ..., Dec

"%B"	Full month name.	January, February, ...

"%m"	Month as a zero-padded decimal number.	01, 02, ..., 12

"%-m"	Month as a decimal number.	1, 2, ..., 12

"%y"	Year without century as a zero-padded decimal number.	00, 01, ..., 99

"%-y"	Year without century as a decimal number.	0, 1, ..., 99

"%Y"	Year with century as a decimal number.	2013, 2019 etc.

"%H"	Hour (24-hour clock) as a zero-padded decimal number.	00, 01, ..., 23

'%-H'	Hour (24-hour clock) as a decimal number.	0, 1, ..., 23

"%I"	Hour (12-hour clock) as a zero-padded decimal number.	01, 02, ..., 12

"%-I"	Hour (12-hour clock) as a decimal number.	1, 2, ... 12

"%p"	Locale’s AM or PM.	AM, PM

"%M"	Minute as a zero-padded decimal number.	00, 01, ..., 59

"%-M"	Minute as a decimal number.	0, 1, ..., 59

"%S"	Second as a zero-padded decimal number.	00, 01, ..., 59

"%-S"	Second as a decimal number.	0, 1, ..., 59

"%f"	Microsecond as a decimal number, zero-padded on the left.	000000 - 999999

"%z"	UTC offset in the form +HHMM or -HHMM.	 

"%Z"	Time zone name.	 

"%j"	Day of the year as a zero-padded decimal number.	001, 002, ..., 366

"%-j"	Day of the year as a decimal number.	1, 2, ..., 366

"%U"	Week number of the year (Sunday as the first day of the week). All days in a new year preceding the first Sunday are considered to be in week 0.	00, 01, ..., 53
"%W"	Week number of the year (Monday as the first day of the week). All days in a new year preceding the first Monday are considered to be in week 0.	00, 01, ..., 53

"%c"	Locale’s appropriate date and time representation.	Mon Sep 30 07:06:05 2013

"%x"	Locale’s appropriate date representation.	09/30/13

"%X"	Locale’s appropriate time representation.	07:06:05

"%%"	A literal '%' character.	%

In [3]:
date = datetime.today()
date.strftime("%Y, %y, %B, %b, %m, %d, %D, %f, %H, %M, %S")

'2022, 22, July, Jul, 07, 24, 07/24/22, 773052, 11, 36, 37'

In [4]:
data = pd.date_range('1/1/2011', periods=3, freq='s')
data

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 00:00:01',
               '2011-01-01 00:00:02'],
              dtype='datetime64[ns]', freq='S')

In [5]:
data = pd.date_range('1/1/2011 00:00:00', periods=3, freq='min')
data

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 00:01:00',
               '2011-01-01 00:02:00'],
              dtype='datetime64[ns]', freq='T')

In [6]:
data = pd.date_range('1/1/2011 00:00:00', periods=3, freq='h')
data

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')

In [7]:
data = pd.date_range('1/1/2011 00:00:00', periods=3, freq='d')
data

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03'], dtype='datetime64[ns]', freq='D')

In [8]:
data = pd.date_range('1/1/2011 00:00:00', periods=3, freq='m')
data

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31'], dtype='datetime64[ns]', freq='M')

In [9]:
data = pd.date_range('1/1/2011 00:00:00', periods=3, freq='y')
data

DatetimeIndex(['2011-12-31', '2012-12-31', '2013-12-31'], dtype='datetime64[ns]', freq='A-DEC')

### Date in Pandas

In [10]:
df = pd.DataFrame()

df['date'] = pd.date_range('1/1/2001 12:12:12', periods=10, freq='H')

# Create features for year, month, day, hour, and minute
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['hour'] = df['date'].dt.hour
df['minute'] = df['date'].dt.minute

df.head()

                 date  year  month  day  hour  minute
0 2001-01-01 12:12:12  2001      1    1    12      12
1 2001-01-01 13:12:12  2001      1    1    13      12
2 2001-01-01 14:12:12  2001      1    1    14      12
3 2001-01-01 15:12:12  2001      1    1    15      12
4 2001-01-01 16:12:12  2001      1    1    16      12

In [11]:
data = pd.read_csv("todatetime.csv")
data.head()

        Date      Time
0   8/6/1993  12:42 PM
1  3/31/1996   6:53 AM
2  4/23/1993  11:17 AM
3   3/4/2005   1:00 PM
4  1/24/1998   4:47 PM

In [12]:
data["Date_updated"] = pd.to_datetime(data["Date"])
data["Time_updated"] = pd.to_datetime(data["Time"])
data.head()

        Date      Time Date_updated        Time_updated
0   8/6/1993  12:42 PM   1993-08-06 2022-07-24 12:42:00
1  3/31/1996   6:53 AM   1996-03-31 2022-07-24 06:53:00
2  4/23/1993  11:17 AM   1993-04-23 2022-07-24 11:17:00
3   3/4/2005   1:00 PM   2005-03-04 2022-07-24 13:00:00
4  1/24/1998   4:47 PM   1998-01-24 2022-07-24 16:47:00

In [16]:
# Select pertiular data type columns
df.select_dtypes(include=['int16', 'int32', 'int64'])

   year  month  day  hour  minute
0  2001      1    1    12      12
1  2001      1    1    13      12
2  2001      1    1    14      12
3  2001      1    1    15      12
4  2001      1    1    16      12
5  2001      1    1    17      12
6  2001      1    1    18      12
7  2001      1    1    19      12
8  2001      1    1    20      12
9  2001      1    1    21      12